# Missing Data

Let's see few convenient methods to deal with Missing Data in pandas:

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'A':[1,2,np.nan],
                   'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [3]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [6]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [ ]:
# height, weight, age, BMI

In [5]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [9]:
# df.dropna(thresh=2)
df.dropna(thresh=2, axis=1)
# df

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [12]:
df.fillna(value=1)
# df

     A    B  C
0  1.0  5.0  1
1  2.0  1.0  2
2  1.0  1.0  3

In [13]:
df.fillna(value=df.mean())
df['A'].fillna(value=df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3